# **************************************************************************** #
#                                                                              #
#                                                         :::      ::::::::    #
#    ex07-4.py                                          :+:      :+:    :+:    #
#                                                     +:+ +:+         +:+      #
#    By: cbaek <cbaek@student.42seoul.kr>           +#+  +:+       +#+         #
#                                                 +#+#+#+#+#+   +#+            #
#    Created: 2020/10/19 12:15:52 by cbaek             #+#    #+#              #
#    Updated: 2020/10/19 12:17:31 by cbaek            ###   ########.fr        #
#                                                                              #
# **************************************************************************** #

# 예제 7-4 - 한 줄 입력받아 출력하는 소스코드 P.196.

import sys
# 하나의 문자열 데이터 입력받기
input_data = sys.stdin.readline().rstrip()

# 입력받은 문자열 그대로 출력
print(input_data)

# 결과
# $ python ./codes/ch07/ex07-4.py
# Hello,Coding Test!
# Hello,Coding Test!
