# **************************************************************************** #
#                                                                              #
#                                                         :::      ::::::::    #
#    ex06-3.py                                          :+:      :+:    :+:    #
#                                                     +:+ +:+         +:+      #
#    By: cbaek <cbaek@student.42seoul.kr>           +#+  +:+       +#+         #
#                                                 +#+#+#+#+#+   +#+            #
#    Created: 2020/10/18 23:30:14 by cbaek             #+#    #+#              #
#    Updated: 2020/10/18 23:39:44 by cbaek            ###   ########.fr        #
#                                                                              #
# **************************************************************************** #

# 예제 6-3 - 삽입 정렬 소스코드 P.164.

array = [7, 5, 9, 0, 3, 1, 6, 2, 4, 8]

for i in range(1, len(array)):
	for j in range(i, 0, -1): # 인덱스 i부터 1까지 감소하며 반복하는 문법
		if array[j] < array[j - 1]: #한 칸씩 왼쪽으로 이동
			array[j], array[j - 1] = array[j - 1], array[j]
		else: # 자기보다 작은 데이터를 만나면 그 위치에서 멈춤
			break

print(array)

# 결과
# $ python codes/ch06/ex06-3.py
# [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
