# **************************************************************************** #
#                                                                              #
#                                                         :::      ::::::::    #
#    ex10-2.py                                          :+:      :+:    :+:    #
#                                                     +:+ +:+         +:+      #
#    By: cbaek <cbaek@student.42seoul.kr>           +#+  +:+       +#+         #
#                                                 +#+#+#+#+#+   +#+            #
#    Created: 2020/10/23 16:50:41 by cbaek             #+#    #+#              #
#    Updated: 2020/10/23 16:52:16 by cbaek            ###   ########.fr        #
#                                                                              #
# **************************************************************************** #

# 예제 10-2 - 경로 압축 기법 P.275.

def find_parent(parent, x):
	if parent[x] != x:
		parent[x] = find_parent(parent, parent[x])
	return parent[x]
