# **************************************************************************** #
#                                                                              #
#                                                         :::      ::::::::    #
#    q03-until-one2.py                                  :+:      :+:    :+:    #
#                                                     +:+ +:+         +:+      #
#    By: cbaek <cbaek@student.42seoul.kr>           +#+  +:+       +#+         #
#                                                 +#+#+#+#+#+   +#+            #
#    Created: 2020/10/10 18:06:54 by cbaek             #+#    #+#              #
#    Updated: 2020/10/10 18:20:17 by cbaek            ###   ########.fr        #
#                                                                              #
# **************************************************************************** #

# 실전문제 - 1이 될 때까지 P.102. 답안2

n, k = map(int, input().split())
result = 0

while True:
	# (N == K로 나누어 떨어지는 수)가 될 때까지 1씩 빼기
	target = (n // k) * k
	result += (n - target)
	n = target
	# N이 K보다 작을 때(더 이상 나눌 수 없을 때) 반복문 탈출
	if n < k:
		break
	# K로 나누기
	result += 1
	n //= k

# 마지막으로 남은 수에 대하여 1씩 빼기
result += (n - 1)
print(result)
