# **************************************************************************** #
#                                                                              #
#                                                         :::      ::::::::    #
#    ex08-4.py                                          :+:      :+:    :+:    #
#                                                     +:+ +:+         +:+      #
#    By: cbaek <cbaek@student.42seoul.kr>           +#+  +:+       +#+         #
#                                                 +#+#+#+#+#+   +#+            #
#    Created: 2020/10/20 18:23:17 by cbaek             #+#    #+#              #
#    Updated: 2020/10/20 18:46:35 by cbaek            ###   ########.fr        #
#                                                                              #
# **************************************************************************** #

# 예제 8-4 - 피보나치 수열(반복적) P.210.

# 앞서 계산된 결과를 저장하기 위한 DP 테이블 초기화
d = [0] * 100

# 첫 번째 피보나치 수와 두 번째 피보나치 수는 1
d[1] = 1
d[2] = 1
n = 99

# 피보나치 함수(Fibonacci Function) 반복문으로 구현(보텀업 다이나믹 프로그래밍)
for i in range(3, n + 1):
	d[i] = d[i - 1] + d[i - 2]

print(d[n])

# 결과
# $ python codes/ch08/ex08-4.py
# 218922995834555169026
