# **************************************************************************** #
#                                                                              #
#                                                         :::      ::::::::    #
#    ex08-1.py                                          :+:      :+:    :+:    #
#                                                     +:+ +:+         +:+      #
#    By: cbaek <cbaek@student.42seoul.kr>           +#+  +:+       +#+         #
#                                                 +#+#+#+#+#+   +#+            #
#    Created: 2020/10/20 18:07:47 by cbaek             #+#    #+#              #
#    Updated: 2020/10/20 18:16:06 by cbaek            ###   ########.fr        #
#                                                                              #
# **************************************************************************** #

# 예제 8-1 - 피보나치 함수 P.210.

# 피보나치 함수(Fibonacci Function)를 재귀 함수로 구현
def fibo(x):
	if x == 1 or x == 2:
		return 1
	return fibo(x - 1) + fibo(x - 2)

print(fibo(4))

# 결과
# $ python codes/ch08/ex08-1.py
# 3
